irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_cec_1283_IUT.c
  uint16_t tmpreg = 0;


  ((void)0);
  ((void)0);



  tmpreg = ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CFGR;


  tmpreg &= (uint8_t)(0xF3);


  tmpreg |= (uint16_t)(CEC_InitStruct->CEC_BitTimingMode | CEC_InitStruct->CEC_BitPeriodMode);


  ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CFGR = tmpreg;


CS_CMM_PROBE_NODE_STMT(44,1,1) 
 CODESCROLL_FUNC_END(74, 5, 155) } CODESCROLL_FUNC_END_RBRACE 







void CEC_Cmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(75, (75, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable209,217) 

  
  CS_CMM_PROBE_NODE_STMT(44,0,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x7800) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x00 * 4)) = (uint32_t)NewState;

  
  CS_CMM_PROBE_NODE_STMT(45,7,1) if(NewState == DISABLE)
  {

    while( CS_CMM_PROBE_NODE_EXPR(45,6,2) (((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CFGR & ((uint16_t)0x0001)) != (uint32_t)RESET)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable210,218) 
    
    CS_CMM_PROBE_NODE_STMT(45,5,3) } CS_CMM_PROBE_C1(219) CS_CMM_LABEL(cs_cmm_while_end_75_2) 
  } CS_CMM_ELSE_PROBE_C1(220) 

CS_CMM_PROBE_NODE_STMT(45,4,4) 
 CODESCROLL_FUNC_END(75, 5, 177) } CODESCROLL_FUNC_END_RBRACE 







void CEC_ITConfig(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(76, (76, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable211,221) 

  
  CS_CMM_PROBE_NODE_STMT(45,3,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x7800) - ((uint32_t)0x40000000)) + 0x00) * 32) + (0x01 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(45,2,1) 
 CODESCROLL_FUNC_END(76, 5, 191) } CODESCROLL_FUNC_END_RBRACE 






void CEC_OwnAddressConfig(uint8_t CEC_OwnAddress)
{ CODESCROLL_FUNC_BEGIN(77, (77, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable212,222) 

  
  CS_CMM_PROBE_NODE_STMT(45,1,0) ((void)0);


  ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->OAR = CEC_OwnAddress;

CS_CMM_PROBE_NODE_STMT(45,0,1) 
 CODESCROLL_FUNC_END(77, 5, 205) } CODESCROLL_FUNC_END_RBRACE 






void CEC_SetPrescaler(uint16_t CEC_Prescaler)
{ CODESCROLL_FUNC_BEGIN(78, (78, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable213,223) 

  
  CS_CMM_PROBE_NODE_STMT(46,7,0) ((void)0);


  ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->PRES = CEC_Prescaler;

CS_CMM_PROBE_NODE_STMT(46,6,1) 
 CODESCROLL_FUNC_END(78, 5, 219) } CODESCROLL_FUNC_END_RBRACE 






void CEC_SendDataByte(uint8_t Data)
{ CODESCROLL_FUNC_BEGIN(79, (79, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable214,224) 

  
  CS_CMM_PROBE_NODE_STMT(46,5,0) ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->TXD = Data ;

CS_CMM_PROBE_NODE_STMT(46,4,1) 
 CODESCROLL_FUNC_END(79, 5, 230) } CODESCROLL_FUNC_END_RBRACE 







uint8_t CEC_ReceiveDataByte(void)
{ CODESCROLL_FUNC_BEGIN(80, (80, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable215,225) 

  
  CS_CMM_PROBE_NODE_STMT(46,3,0) 
  CS_CMM_PROBE_NODE_STMT(46,2,1) 
   CODESCROLL_FUNC_END(80, 5, 241) return (uint8_t)(((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->RXD);
} CODESCROLL_FUNC_END_RBRACE 






void CEC_StartOfMessage(void)
{ CODESCROLL_FUNC_BEGIN(81, (81, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable216,226) 

  
  CS_CMM_PROBE_NODE_STMT(46,1,0) *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x7800) - ((uint32_t)0x40000000)) + 0x10) * 32) + (0x00 * 4)) = (uint32_t)0x1;

CS_CMM_PROBE_NODE_STMT(46,0,1) 
 CODESCROLL_FUNC_END(81, 5, 253) } CODESCROLL_FUNC_END_RBRACE 







void CEC_EndOfMessageCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(82, (82, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable217,227) 

  
  CS_CMM_PROBE_NODE_STMT(47,7,0) ((void)0);


  *(volatile uint32_t *) (((uint32_t)0x42000000) + ((((((uint32_t)0x40000000) + 0x7800) - ((uint32_t)0x40000000)) + 0x10) * 32) + (0x01 * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(47,6,1) 
 CODESCROLL_FUNC_END(82, 5, 268) } CODESCROLL_FUNC_END_RBRACE 
/* # 290 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_cec.c"*/
FlagStatus CEC_GetFlagStatus(uint32_t CEC_FLAG)
{ CODESCROLL_FUNC_BEGIN(83, (83, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable218,228) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable219,47,5,0)

  FlagStatus bitstatus = RESET;
  uint32_t cecreg = 0, cecbase = 0;


  ((void)0);


  cecbase = (uint32_t)((((uint32_t)0x40000000) + 0x7800));


  cecreg = CEC_FLAG >> 28;


  CEC_FLAG &= ((uint32_t)0x00FFFFFF);

  
  CS_CMM_PROBE_NODE_STMT(47,4,1) if(cecreg != 0)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable220,229) 

    
    CS_CMM_PROBE_NODE_STMT(47,3,2) CEC_FLAG = (uint32_t)(CEC_FLAG >> 16);


    cecbase += 0xC;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable221,230) 

    
    CS_CMM_PROBE_NODE_STMT(47,2,3) cecbase += 0x10;
  }

  
  CS_CMM_PROBE_NODE_STMT(47,1,4) if(((*(volatile uint32_t *)cecbase) & CEC_FLAG) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable222,231) 

    
    CS_CMM_PROBE_NODE_STMT(47,0,5) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable223,232) 

    
    CS_CMM_PROBE_NODE_STMT(48,7,6) bitstatus = RESET;
  }


  
  CS_CMM_PROBE_NODE_STMT(48,6,7) 
   CODESCROLL_FUNC_END(83, 5, 333) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 348 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_cec.c"*/
void CEC_ClearFlag(uint32_t CEC_FLAG)
{ CODESCROLL_FUNC_BEGIN(84, (84, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable224,233) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable225,48,5,0)

  uint32_t tmp = 0x0;


  ((void)0);

  tmp = ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CSR & 0x2;


