irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_cec_1283_IUT.c
  ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CSR &= (uint32_t)(((~(uint32_t)CEC_FLAG) & 0xFFFFFFFC) | tmp);

CS_CMM_PROBE_NODE_STMT(48,4,1) 
 CODESCROLL_FUNC_END(84, 5, 359) } CODESCROLL_FUNC_END_RBRACE 
/* # 371 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_cec.c"*/
ITStatus CEC_GetITStatus(uint8_t CEC_IT)
{ CODESCROLL_FUNC_BEGIN(85, (85, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable226,234) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable227,48,3,0)

  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;


   ((void)0);


  enablestatus = (((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CFGR & (uint8_t)((uint16_t)0x0002)) ;


  
  CS_CMM_PROBE_NODE_STMT(48,2,1) if (CS_MCDC_85_0(((((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CSR & CEC_IT) != (uint32_t)RESET), enablestatus, 12))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable228,8) 

    
    CS_CMM_PROBE_NODE_STMT(48,1,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable229,9) 

    
    CS_CMM_PROBE_NODE_STMT(48,0,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(49,7,4) 
   CODESCROLL_FUNC_END(85, 5, 394) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 407 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_cec.c"*/
void CEC_ClearITPendingBit(uint16_t CEC_IT)
{ CODESCROLL_FUNC_BEGIN(86, (86, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable230,235) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable231,49,6,0)

  uint32_t tmp = 0x0;


  ((void)0);

  tmp = ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CSR & 0x2;


  ((CEC_TypeDef *) (((uint32_t)0x40000000) + 0x7800))->CSR &= (uint32_t)(((~(uint32_t)CEC_IT) & 0xFFFFFFFC) | tmp);

CS_CMM_PROBE_NODE_STMT(49,5,1) 
 CODESCROLL_FUNC_END(86, 5, 418) } CODESCROLL_FUNC_END_RBRACE 
